RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal.c
  MODIFY_REG(SBS->PMCR, SBS_PMCR_ETH_SEL_PHY, (uint32_t)(SBS_ETHInterface));
}
#endif /* SBS_PMCR_ETH_SEL_PHY */

/**
  * @brief  Enables the VDD I/Os Compensation Cell.
  * @note   The I/O compensation cell can be used only when the device supply
  *         voltage ranges from 2.4 to 3.6 V.
  * @retval None
  */
void HAL_SBS_EnableVddIO1CompensationCell(void)
{
  SET_BIT(SBS->CCCSR, SBS_CCCSR_EN1) ;
}

/**
  * @brief  Power-down the VDD I/Os Compensation Cell.
  * @note   The I/O compensation cell can be used only when the device supply
  *         voltage ranges from 2.4 to 3.6 V.
  * @retval None
  */
void HAL_SBS_DisableVddIO1CompensationCell(void)
{
  CLEAR_BIT(SBS->CCCSR, SBS_CCCSR_EN1);
}

/**
  * @brief  Enables the VDDIO2 I/Os Compensation Cell.
  * @note   The I/O compensation cell can be used only when the device supply
  *         voltage ranges from 2.4 to 3.6 V.
  * @retval None
  */
void HAL_SBS_EnableVddIO2CompensationCell(void)
{
  SET_BIT(SBS->CCCSR, SBS_CCCSR_EN2) ;
}

/**
  * @brief  Power-down the VDDIO2 I/Os Compensation Cell.
  * @note   The I/O compensation cell can be used only when the device supply
  *         voltage ranges from 2.4 to 3.6 V.
  * @retval None
  */
void HAL_SBS_DisableVddIO2CompensationCell(void)
{
  CLEAR_BIT(SBS->CCCSR, SBS_CCCSR_EN2);
}

/**
  * @brief  Code selection for the VDD I/O Compensation cell
  * @param  SBS_CompCode: Selects the code to be applied for the I/O compensation cell
  *         This parameter can be one of the following values:
  *           @arg SBS_VDD_CELL_CODE : Select Code from the cell (available in the SBS_CCVALR)
  *           @arg SBS_VDD_REGISTER_CODE: Select Code from the SBS compensation cell code register (SBS_CCSWCR)
  * @retval None
  */
void HAL_SBS_VDDCompensationCodeSelect(uint32_t SBS_CompCode)
{
  /* Check the parameter */
  assert_param(IS_SBS_VDD_CODE_SELECT(SBS_CompCode));
  MODIFY_REG(SBS->CCCSR, SBS_CCCSR_CS1, (uint32_t)(SBS_CompCode));
}

/**
  * @brief  Code selection for the VDDIO I/O Compensation cell
  * @param  SBS_CompCode: Selects the code to be applied for the I/O compensation cell
  *         This parameter can be one of the following values:
  *           @arg SBS_VDDIO_CELL_CODE : Select Code from the cell (available in the SBS_CCVALR)
  *           @arg SBS_VDDIO_REGISTER_CODE: Select Code from the SBS compensation cell code register (SBS_CCSWCR)
  * @retval None
  */
void HAL_SBS_VDDIOCompensationCodeSelect(uint32_t SBS_CompCode)
{
  /* Check the parameter */
  assert_param(IS_SBS_VDDIO_CODE_SELECT(SBS_CompCode));
  MODIFY_REG(SBS->CCCSR, SBS_CCCSR_CS2, (uint32_t)(SBS_CompCode));
}

/**
  * @brief  VDDIO1 I/O Compensation cell get ready flag status
  * @retval State of bit (1 or 0).
  */
uint32_t HAL_SBS_GetVddIO1CompensationCellReadyFlag(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_RDY1) == SBS_CCCSR_RDY1) ? 1UL : 0UL);
}

/**
  * @brief  VDDIO2 I/O Compensation cell get ready flag status
  * @retval State of bit (1 or 0).
  */
uint32_t HAL_SBS_GetVddIO2CompensationCellReadyFlag(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_RDY2) == SBS_CCCSR_RDY2) ? 1UL : 0UL);
}

/**
  * @brief  Code configuration for the VDD I/O Compensation cell
  * @param  SBS_PMOSCode: PMOS compensation code
  *         This code is applied to the VDD I/O compensation cell when the CS1 bit of the
  *          SBS_CCSR is set
  * @param  SBS_NMOSCode: NMOS compensation code
  *         This code is applied to the VDD I/O compensation cell when the CS1 bit of the
  *          SBS_CCSR is set
  * @retval None
  */
void HAL_SBS_VDDCompensationCodeConfig(uint32_t SBS_PMOSCode, uint32_t SBS_NMOSCode)
{
  /* Check the parameter */
  assert_param(IS_SBS_CODE_CONFIG(SBS_PMOSCode));
  assert_param(IS_SBS_CODE_CONFIG(SBS_NMOSCode));
  MODIFY_REG(SBS->CCSWCR, SBS_CCSWCR_SW_ANSRC1 | SBS_CCSWCR_SW_APSRC1, (((uint32_t)(SBS_PMOSCode) << 4) | \
                                                                        (uint32_t)(SBS_NMOSCode)));
}

/**
  * @brief  Code configuration for the VDDIO I/O Compensation cell
  * @param  SBS_PMOSCode: PMOS compensation code
  *         This code is applied to the VDDIO I/O compensation cell when the CS2 bit of the
  *          SBS_CCSR is set
  * @param  SBS_NMOSCode: NMOS compensation code
  *         This code is applied to the VDDIO I/O compensation cell when the CS2 bit of the
  *          SBS_CCSR is set
  * @retval None
  */
void HAL_SBS_VDDIOCompensationCodeConfig(uint32_t SBS_PMOSCode, uint32_t SBS_NMOSCode)
{
  /* Check the parameter */
  assert_param(IS_SBS_CODE_CONFIG(SBS_PMOSCode));
  assert_param(IS_SBS_CODE_CONFIG(SBS_NMOSCode));
  MODIFY_REG(SBS->CCSWCR, SBS_CCSWCR_SW_ANSRC2 | SBS_CCSWCR_SW_APSRC2, (((uint32_t)(SBS_PMOSCode) << 12) | \
                                                                        ((uint32_t)(SBS_NMOSCode) << 8)));
}

/**
  * @brief  Get NMOS compensation value of the I/Os supplied by VDD
  * @retval None
  */
uint32_t HAL_SBS_GetNMOSVddCompensationValue(void)
{
  return (uint32_t)(READ_BIT(SBS->CCVALR, SBS_CCVALR_ANSRC1));
}

/**
  * @brief  Get PMOS compensation value of the I/Os supplied by VDD
  * @retval None
  */
uint32_t HAL_SBS_GetPMOSVddCompensationValue(void)
{
  return (uint32_t)(READ_BIT(SBS->CCVALR, SBS_CCVALR_APSRC1) >>  SBS_CCVALR_APSRC1_Pos);
}

/**
  * @brief  Get NMOS compensation value of the I/Os supplied by VDDIO2
  * @retval None
  */
uint32_t HAL_SBS_GetNMOSVddIO2CompensationValue(void)
{
  return (uint32_t)(READ_BIT(SBS->CCVALR, SBS_CCVALR_ANSRC2) >>  SBS_CCVALR_ANSRC2_Pos);
}


/**
  * @brief  Get PMOS compensation value of the I/Os supplied by VDDIO2
  * @retval None
  */
uint32_t HAL_SBS_GetPMOSVddIO2CompensationValue(void)
{
  return (uint32_t)(READ_BIT(SBS->CCVALR, SBS_CCVALR_APSRC2) >>  SBS_CCVALR_APSRC2_Pos);
}

/**
  * @brief  Disable the NMI in case of double ECC error in FLASH Interface.
  *
  * @retval None
  */
void HAL_SBS_FLASH_DisableECCNMI(void)
{
  SET_BIT(SBS->ECCNMIR, SBS_ECCNMIR_ECCNMI_MASK_EN);
}

/**
  * @brief  Enable the NMI in case of double ECC error in FLASH Interface.
  *
  * @retval None
  */
void HAL_SBS_FLASH_EnableECCNMI(void)
{
  CLEAR_BIT(SBS->ECCNMIR, SBS_ECCNMIR_ECCNMI_MASK_EN);
}

/**
  * @brief  Check if the NMI is Enabled in case of double ECC error in FLASH Interface.
  *
  * @retval State of bit (1 or 0).
  */
uint32_t HAL_SBS_FLASH_ECCNMI_IsDisabled(void)
{
  return ((READ_BIT(SBS->ECCNMIR, SBS_ECCNMIR_ECCNMI_MASK_EN) == SBS_ECCNMIR_ECCNMI_MASK_EN) ? 1UL : 0UL);
}

/**
  * @}
  */

