RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal.c
/** @defgroup HAL_Exported_Functions_Group6 HAL SBS Boot control functions
  *  @brief    HAL SBS Boot functions
  *
@verbatim
 =======================================================================================================================
                                       ##### HAL SBS Boot control functions #####
 =======================================================================================================================
    [..]  This section provides functions allowing to:
      (+) Increment the HDPL value
      (+) Get the HDPL value

@endverbatim
  * @{
  */

/**
  * @brief  Increment by 1 the HDPL value
  * @retval None
  */
void HAL_SBS_IncrementHDPLValue(void)
{
  MODIFY_REG(SBS->HDPLCR, SBS_HDPLCR_INCR_HDPL, SBS_HDPL_INCREMENT_VALUE);
}

/**
  * @brief  Get the HDPL Value.
  *
  * @retval  Returns the HDPL value
  *          This return value can be one of the following values:
  *            @arg SBS_HDPL_VALUE_0: HDPL0
  *            @arg SBS_HDPL_VALUE_1: HDPL1
  *            @arg SBS_HDPL_VALUE_2: HDPL2
  *            @arg SBS_HDPL_VALUE_3: HDPL3
  */
uint32_t HAL_SBS_GetHDPLValue(void)
{
  return (uint32_t)(READ_BIT(SBS->HDPLSR, SBS_HDPLSR_HDPL));
}

/**
  * @}
  */

/** @defgroup HAL_Exported_Functions_Group7 HAL SBS Hardware secure storage control functions
  *  @brief    HAL SBS Hardware secure storage functions
  *
@verbatim
 =======================================================================================================================
                                       ##### HAL SBS Hardware secure storage control functions #####
 =======================================================================================================================
    [..]  This section provides functions allowing to:
      (+) Select EPOCH security sent to SAES IP
      (+) Set/Get EPOCH security selection
      (+) Set/Get the OBK-HDPL Value

@endverbatim
  * @{
  */

#if defined(SBS_EPOCHSELCR_EPOCH_SEL)
/**
  * @brief  Select EPOCH security sent to SAES IP to encrypt/decrypt keys
  * @param  Epoch_Selection: Select EPOCH security
  *         This parameter can be one of the following values:
  *           @arg SBS_EPOCH_SEL_SECURE    : EPOCH secure selected.
  *           @arg SBS_EPOCH_SEL_NONSECURE : EPOCH non secure selected.
  *           @arg SBS_EPOCH_SEL_PUFCHECK  : EPOCH all zeros for PUF integrity check.
  * @retval None
  */
void HAL_SBS_EPOCHSelection(uint32_t Epoch_Selection)
{
  /* Check the parameter */
  assert_param(IS_SBS_EPOCH_SELECTION(Epoch_Selection));

  MODIFY_REG(SBS->EPOCHSELCR, SBS_EPOCHSELCR_EPOCH_SEL, (uint32_t)(Epoch_Selection));
}

/**
  * @brief  Get EPOCH security selection
  * @retval Returned value can be one of the following values:
  *           @arg SBS_EPOCH_SEL_SECURE    : EPOCH secure selected.
  *           @arg SBS_EPOCH_SEL_NONSECURE : EPOCH non secure selected.
  *           @arg SBS_EPOCH_SEL_PUFCHECK  : EPOCH all zeros for PUF integrity check.
  */
uint32_t HAL_SBS_GetEPOCHSelection(void)
{
  return (uint32_t)(READ_BIT(SBS->EPOCHSELCR, SBS_EPOCHSELCR_EPOCH_SEL));
}
#endif /* SBS_EPOCHSELCR_EPOCH_SEL */

#if defined(SBS_NEXTHDPLCR_NEXTHDPL)
/**
  * @brief  Set the OBK-HDPL Value.
  * @param  OBKHDPL_Value Value of the increment to add to HDPL value to generate the OBK-HDPL.
  *         This parameter can be one of the following values:
  *           @arg SBS_OBKHDPL_INCR_0 : HDPL
  *           @arg SBS_OBKHDPL_INCR_1 : HDPL + 1
  *           @arg SBS_OBKHDPL_INCR_2 : HDPL + 2
  *           @arg SBS_OBKHDPL_INCR_3 : HDPL + 3
  * @retval None
  */
void HAL_SBS_SetOBKHDPL(uint32_t OBKHDPL_Value)
{
  /* Check the parameter */
  assert_param(IS_SBS_OBKHDPL_SELECTION(OBKHDPL_Value));

  MODIFY_REG(SBS->NEXTHDPLCR, SBS_NEXTHDPLCR_NEXTHDPL, (uint32_t)(OBKHDPL_Value));
}

/**
  * @brief  Get the OBK-HDPL Value.
  * @retval  Returns the incremement to add to HDPL value to generate OBK-HDPL
  *          This return value can be one of the following values:
  *            @arg SBS_OBKHDPL_INCR_0: HDPL
  *            @arg SBS_OBKHDPL_INCR_1: HDPL + 1
  *            @arg SBS_OBKHDPL_INCR_2: HDPL + 2
  *            @arg SBS_OBKHDPL_INCR_3: HDPL + 3
  */
uint32_t HAL_SBS_GetOBKHDPL(void)
{
  return (uint32_t)(READ_BIT(SBS->NEXTHDPLCR, SBS_NEXTHDPLCR_NEXTHDPL));
}
#endif /* SBS_NEXTHDPLCR_NEXTHDPL */

/**
  * @}
  */

/** @defgroup HAL_Exported_Functions_Group8 HAL SBS Debug control functions
  *  @brief    HAL SBS Debug functions
  *
@verbatim
 =======================================================================================================================
                                       ##### SBS Debug control functions #####
 =======================================================================================================================
    [..]  This section provides functions allowing to:
      (+) Open the device access port
      (+) Open the debug
      (+) Configure the authenticated debug HDPL
      (+) Get the current value of the hide protection level
      (+) Lock the access to the debug control register
      (+) Configure/Get the authenticated debug security access

@endverbatim
  * @{
  */

/**
  * @brief  Open the device access port.
  * @note   This function can be only used when device state is Closed.
  * @retval None
  */
void HAL_SBS_OpenAccessPort(void)
{
  MODIFY_REG(SBS->DBGCR, SBS_DBGCR_AP_UNLOCK, SBS_DEBUG_UNLOCK_VALUE);
}

/**
  * @brief  Open the debug when the hide protection level is authorized.
  * @note   This function can be only used when device state is Closed.
  * @retval None
  */
void HAL_SBS_OpenDebug(void)
{
  MODIFY_REG(SBS->DBGCR, SBS_DBGCR_DBG_UNLOCK, (SBS_DEBUG_UNLOCK_VALUE << SBS_DBGCR_DBG_UNLOCK_Pos));
}

/**
  * @brief  Configure the authenticated debug hide protection level.
  * @note   This function can be only used when device state is Closed.
  * @param  Level Hide protection level where the authenticated debug opens
  *            This value is one of @ref SBS_HDPL_Value (except SBS_HDPL_VALUE_0)
  * @retval HAL_OK if parameter is correct
  *         HAL_ERROR otherwise
  */
HAL_StatusTypeDef HAL_SBS_ConfigDebugLevel(uint32_t Level)
{
  /* Check the parameter */
  assert_param(IS_SBS_HDPL(Level));

  if (Level != SBS_HDPL_VALUE_0)
  {
    MODIFY_REG(SBS->DBGCR, SBS_DBGCR_DBG_AUTH_HDPL, (Level << SBS_DBGCR_DBG_AUTH_HDPL_Pos));
    return HAL_OK;
  }
  else
  {
    return HAL_ERROR;
  }
}

/**
  * @brief  Get the current value of the hide protection level.
  * @note   This function can be only used when device state is Closed.
  * @retval Current hide protection level
  *            This value is one of @ref SBS_HDPL_Value
  */
uint32_t HAL_SBS_GetDebugLevel(void)
{
  return ((SBS->DBGCR & SBS_DBGCR_DBG_AUTH_HDPL) >> SBS_DBGCR_DBG_AUTH_HDPL_Pos);
}

/**
  * @brief  Lock the access to the debug control register.
  * @note   This function can be only used when device state is Closed.
  * @note   locking the current debug configuration is released only by a reset.
  * @retval None
  */
void HAL_SBS_LockDebugConfig(void)
{
  MODIFY_REG(SBS->DBGLOCKR, SBS_DBGLOCKR_DBGCFG_LOCK, SBS_DEBUG_LOCK_VALUE);
}

