RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal.c
#if defined(SBS_DBGCR_DBG_AUTH_SEC)
/**
  * @brief  Configure the authenticated debug security access.
  * @param  Control debug opening secure/non-secure or non-secure only
  *         This parameter can be one of the following values:
  *            @arg SBS_DEBUG_SEC_NSEC: debug opening for secure and non-secure.
  *            @arg SBS_DEBUG_NSEC: debug opening for non-secure only.
  * @retval None
  */
void HAL_SBS_ConfigDebugSecurity(uint32_t Security)
{
  MODIFY_REG(SBS->DBGCR, SBS_DBGCR_DBG_AUTH_SEC, (Security << SBS_DBGCR_DBG_AUTH_SEC_Pos));
}

/**
  * @brief  Get the current value of the hide protection level.
  * @note   This function can be only used when device state is Closed.
  * @retval Returned value can be one of the following values:
  *            @arg SBS_DEBUG_SEC_NSEC: debug opening for secure and non-secure.
  *            @arg SBS_DEBUG_NSEC: debug opening for non-secure only.
  */
uint32_t HAL_SBS_GetDebugSecurity(void)
{
  return ((SBS->DBGCR & SBS_DBGCR_DBG_AUTH_SEC) >> SBS_DBGCR_DBG_AUTH_SEC_Pos);
}
#endif /* SBS_DBGCR_DBG_AUTH_SEC */

/**
  * @}
  */

/** @defgroup HAL_Exported_Functions_Group9 HAL SBS lock management functions
  *  @brief SBS lock management functions.
  *
@verbatim
 =======================================================================================================================
                                        ##### SBS lock functions #####
 =======================================================================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Lock the SBS item(s).
  * @note   Setting lock(s) depends on privilege mode in secure/non-secure code
  *         Lock(s) cleared only at system reset
  * @param  Item Item(s) to set lock on.
  *         This parameter can be a combination of @ref SBS_Lock_items
  * @retval None
  */
void HAL_SBS_Lock(uint32_t Item)
{
  /* Check the parameters */
  assert_param(IS_SBS_LOCK_ITEMS(Item));

  /* Privilege secure/non-secure locks */
  SBS->CNSLCKR = (0xFFFFU & Item);  /* non-secure lock item in 16 lowest bits */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  /* Privilege secure only locks */
  SBS->CSLCKR = ((0xFFFF0000U & Item) >> 16U);  /* Secure-only lock item in 16 highest bits */
#endif /* __ARM_FEATURE_CMSE */
}

/**
  * @brief  Get the lock state of SBS items.
  * @note   Getting lock(s) depends on privilege mode in secure/non-secure code
  * @param  pItem pointer to return locked items
  *         the return value can be a combination of @ref SBS_Lock_items
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SBS_GetLock(uint32_t *pItem)
{
  uint32_t tmp_lock;

  /* Check null pointer */
  if (pItem == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the non-secure lock state */
  tmp_lock = SBS->CNSLCKR;

  /* Get the secure lock state in secure code */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  tmp_lock |= (SBS->CSLCKR << 16U);
#endif /* __ARM_FEATURE_CMSE */

  /* Return overall lock status */
  *pItem = tmp_lock;

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup HAL_Exported_Functions_Group10 HAL SBS attributes management functions
  *  @brief SBS attributes management functions.
  *
@verbatim
 =======================================================================================================================
                                        ##### SBS attributes functions #####
 =======================================================================================================================

@endverbatim
  * @{
  */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Configure the SBS item attribute(s).
  * @note   Available attributes are to secure SBS items, so this function is
  *         only available in secure.
  *         SBS_FPU item attribute is only configurable through PRIVILEGE transaction.
  * @param  Item Item(s) to set attributes on.
  *         This parameter can be a one or a combination of @ref SBS_Attributes_items
  * @param  Attributes  specifies the secure/non-secure attributes.
  * @retval None
  */
void HAL_SBS_ConfigAttributes(uint32_t Item, uint32_t Attributes)
{
  uint32_t tmp;

  /* Check the parameters */
  assert_param(IS_SBS_ITEMS_ATTRIBUTES(Item));
  assert_param(IS_SBS_ATTRIBUTES(Attributes));

  tmp = SBS->SECCFGR;

  /* Set or reset Item */
  if ((Attributes & SBS_SEC) != 0x00U)
  {
    tmp |= Item;
  }
  else
  {
    tmp &= ~Item;
  }

  /* Set secure attributes */
  SBS->SECCFGR = tmp;
}


/**
  * @brief  Get the attribute of a SBS items.
  * @note   Available attributes have read restrictions, so this function is
  *         only available in secure
  * @param  Item Single item to get secure/non-secure attribute from.
  * @param  pAttributes pointer to return the attribute.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SBS_GetConfigAttributes(uint32_t Item, uint32_t *pAttributes)
{
  /* Check null pointer */
  if (pAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_SBS_ITEMS_ATTRIBUTES(Item));

  /* Get the secure attribute state */
  if ((SBS->SECCFGR & Item) != 0U)
  {
    *pAttributes = SBS_SEC;
  }
  else
  {
    *pAttributes = SBS_NSEC;
  }

  return HAL_OK;
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

